Public Attributes | List of all members
ACAPI::MEP::RoutingSegmentCrossSectionData Struct Reference
MEP Element Manager
Defines the necessary data for placing RoutingSegments of a RouteElement. More...
#include <MEPTypes.hpp>
 Public Attributes
double  | width
double  | height
ConnectorShape  | shape
Detailed Description
Defines the necessary data for placing RoutingSegments of a RouteElement.
Member Data Documentation
◆ height
 double ACAPI::MEP::RoutingSegmentCrossSectionData::height
◆ shape
 ConnectorShape ACAPI::MEP::RoutingSegmentCrossSectionData::shape
◆ width
 double ACAPI::MEP::RoutingSegmentCrossSectionData::width